-- 院友個人基本資料匯入 SQL 語句
-- 生成時間: 2026-07-03
-- 總共記錄數: 101 筆

-- 注意: 以下 SQL 語句會插入院友基本資料
-- 執行前請確保已備份原有數據

BEGIN TRANSACTION;

-- 記錄 1
INSERT INTO "院友主表" ("床號", "中文姓名", "英文姓名", "性別", "身份證號碼", "出生日期", "入住日期", "護理等級", "入住類型", "在住狀態") 
VALUES ('A101-1', '關春杏', 'KWAN, Chun Hung', '女', 'B645276(6)', '1929-01-01', '2025-06-06', '全護理', '買位', '在住');

-- 記錄 2
INSERT INTO "院友主表" ("床號", "中文姓名", "英文姓名", "性別", "身份證號碼", "出生日期", "入住日期", "護理等級", "入住類型", "在住狀態") 
VALUES ('A101-2', '李玉嬋', 'LEE, Yuk Sim', '女', 'B727108(0)', '1934-01-01', '2023-02-06', '全護理', '買位', '在住');

-- 記錄 3
INSERT INTO "院友主表" ("床號", "中文姓名", "英文姓名", "性別", "身份證號碼", "出生日期", "入住日期", "護理等級", "入住類型", "在住狀態") 
VALUES ('A103-2', '張香多', 'CHEUNG, Hang Tor', '女', 'B519480(1)', '1918-01-01', '2014-09-20', '全護理', '買位', '在住');

-- 記錄 4
INSERT INTO "院友主表" ("床號", "中文姓名", "英文姓名", "性別", "身份證號碼", "出生日期", "入住日期", "護理等級", "入住類型", "在住狀態") 
VALUES ('A105-1', '劉仕聰', 'LAU, Sze Chung', '男', 'G550124(4)', '1965-06-16', '2023-09-09', '半護理', '私位', '在住');

-- 記錄 5
INSERT INTO "院友主表" ("床號", "中文姓名", "英文姓名", "性別", "身份證號碼", "出生日期", "入住日期", "護理等級", "入住類型", "在住狀態") 
VALUES ('A106-1', '黃秋紅', 'WONG, Chau Hung', '女', 'D460534(A)', '1966-01-23', '2026-06-17', '半護理', '私位', '在住');

-- 記錄 6
INSERT INTO "院友主表" ("床號", "中文姓名", "英文姓名", "性別", "身份證號碼", "出生日期", "入住日期", "護理等級", "入住類型", "在住狀態") 
VALUES ('A106-2', '郭玉珠', 'KWOK, Yuk Chu', '女', 'P127729(8)', '1935-08-27', '2024-02-18', '全護理', '院舍卷', '在住');

-- 記錄 7
INSERT INTO "院友主表" ("床號", "中文姓名", "英文姓名", "性別", "身份證號碼", "出生日期", "入住日期", "護理等級", "入住類型", "在住狀態") 
VALUES ('A107-1', '馬永德', 'MA, Wing Tak', '男', 'K227544(9)', '1933-12-21', '2024-04-26', '全護理', '院舍卷', '在住');

-- 記錄 8
INSERT INTO "院友主表" ("床號", "中文姓名", "英文姓名", "性別", "身份證號碼", "出生日期", "入住日期", "護理等級", "入住類型", "在住狀態") 
VALUES ('A108-1', '郭耀', 'KWOK, Yiu', '男', 'B288175(1)', '1934-01-06', '2026-06-03', '半護理', '私位', '在住');

-- 記錄 9
INSERT INTO "院友主表" ("床號", "中文姓名", "英文姓名", "性別", "身份證號碼", "出生日期", "入住日期", "護理等級", "入住類型", "在住狀態") 
VALUES ('A108-2', '周運才', 'CHOW, Wan Choi', '男', 'B638522(8)', '1937-01-01', '2024-03-23', '全護理', '院舍卷', '在住');

-- 記錄 10
INSERT INTO "院友主表" ("床號", "中文姓名", "英文姓名", "性別", "身份證號碼", "出生日期", "入住日期", "護理等級", "入住類型", "在住狀態") 
VALUES ('A109-1', '梁琼珍', 'LEUNG, King Chun', '女', 'H419259(3)', '1940-02-22', '2023-10-05', '全護理', '院舍卷', '在住');

COMMIT;
